Revit 2027 API
Material.Transparency Property
 The transparency of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Transparency { get; set; }
Public Property Transparency As Integer
	Get
	Set
public:
property int Transparency {
	int get ();
	void set (int value);
}
member Transparency : int with get, set
Property Value
Int32
 The value ranges from 0 to 100.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: values for shininess must be between 0 and 128
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace